YounesGhanem/StepMotor/Projects/STM32F401RE-Nucleo/Examples/MotionControl/MicrosteppingMotor/Src/example_usart.c
	c_id = 0;
	ch = *(pTextString + c_id);
	k_id = 0;
	k_idmax = 2;
	CmdTxt_id = 0;

	UsartTextStringDecodingStatus = DECODE_MOTOR;

	while (ch != '\0') {
		switch (ch) {
		case '.':
			if (UsartTextStringDecodingStatus != DECODE_SAVE ) //DECODE_3rd_PARAM) {
			{
				UsartTextStringDecodingStatus++;
				k_id = 0;
			} else {
#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2, (uint8_t* )"Too much entered parameters.\r\n\r\n");
#endif
				return RESET;
			}
			break;
		case ',':
			CmdTxt_id++;
			if (CmdTxt_id != L6470DAISYCHAINSIZE) {
				UsartTextStringDecodingStatus = DECODE_MOTOR;
				k_id = 0;
			} else {
#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2, (uint8_t* )"Too much addressed L6470.\r\n\r\n");
#endif
				return RESET;
			}
			break;
		default:
			if (k_id != k_idmax) {
				switch (UsartTextStringDecodingStatus) {
				case DECODE_MOTOR:
					k_idmax = 2;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->MotorName) + k_id) =
							ch;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->MotorName)
							+ (k_id + 1)) = '\0';
					break;
				 case DECODE_COMMAND:
				 	k_idmax = 11;
				 	*(((pL6470_TextCommandBundle + CmdTxt_id)->CommandName)
				 			+ k_id) = ch;
				 	*(((pL6470_TextCommandBundle + CmdTxt_id)->CommandName)
				 			+ (k_id + 1)) = '\0';
				 	break;

				case DECODE_SAVE:
					k_idmax = 4;
					*((pL6470_TextCommandBundle + CmdTxt_id)->CommandName + k_id) = ch;
				 	*(((pL6470_TextCommandBundle + CmdTxt_id)->CommandName)
				 			+ (k_id + 1)) = '\0';
					break;

				case DECODE_1st_PARAM:
					k_idmax = 10;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->Param[0]) + k_id) =
							ch;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->Param[0])
							+ (k_id + 1)) = '\0';
					break;
				case DECODE_2nd_PARAM:
					k_idmax = 7;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->Param[1]) + k_id) =
							ch;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->Param[1])
							+ (k_id + 1)) = '\0';
					break;
				case DECODE_3rd_PARAM:
					k_idmax = 7;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->Param[2]) + k_id) =
							ch;
					*(((pL6470_TextCommandBundle + CmdTxt_id)->Param[2])
							+ (k_id + 1)) = '\0';
					break;
				default:
					break;
				}
				k_id++;
			} else {
#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2, (uint8_t* )"Too much entered character.\r\n\r\n");
#endif
				return RESET;
			}
			break;
		}

		c_id++;
		ch = *(pTextString + c_id);
	}
	return SET;
}

/**
 * @brief Check the entered command for L6470
 * @retval FlagStatus  SET or RESET related to the result
 */
FlagStatus USART_CheckTextCommandBundle(
		sL6470_TextCommandBundle *pL6470_TextCommandBundle,
		uint8_t* pL6470_DaisyChainSpiTxStruct) {
	uint8_t PkgId;
	uint8_t spibyte;
	uint8_t i;
	uint8_t CmdTxt_id; /* To index the string command */
	uint8_t MotorMnemonic[4] = "";
	uint8_t* pMotorMnemonic = MotorMnemonic;
	uint8_t L6470_Id;
	eL6470_AppCmdId_t L6470_AppCmdId;
	uint8_t nr_parameters; /* The max number of parameters related to the actual L6470 Application Command */
	eL6470_RegId_t L6470_RegId;
	uint8_t PARAMLengthBytes; /* The number of bytes related to the numeric value for the addressed register */
	uint32_t NumericValue; /* The numeric value to be used into the application command */
	eL6470_DirId_t L6470_DirId;
	eL6470_ActId_t L6470_ActId;

	uint32_t motorPosition0;
	uint32_t motorPosition1;

	/* Reset the structure used to send the command to the L6470 Daisy Chain through the SPI */
	i = 0;
	for (spibyte = 0; spibyte < L6470MAXSPICMDBYTESIZE; spibyte++)
		for (PkgId = 0; PkgId < L6470DAISYCHAINSIZE; PkgId++)
			*(pL6470_DaisyChainSpiTxStruct + (i++)) = 0x00;

	/* Reset the object pointed by mMnemonic */
	*pMotorMnemonic = '\0';

	CmdTxt_id = 0;
	do {

		/* Checks which L6470 in the daisy chain has to be addressed ************** */
		i = 0;
		while (!CompareTwoTextString(
				(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->MotorName,
				(uint8_t*) L6470_DaisyChainMnemonic[i].MotorIdMnemonic)) {
			i++;
			if (i == L6470DAISYCHAINSIZE) {
#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2, (uint8_t* )"It is not possible to identify the L6470.\r\n\r\n");
#endif
				return RESET;
			}
		}

		/* The L6470 to address is known */
		L6470_Id = L6470_ID(i);

		/* Check for different addressed L6470 */
		if (!CompareTwoTextString(
				(uint8_t*) L6470_DaisyChainMnemonic[i].MotorIdMnemonic,
				pMotorMnemonic)) {
			pMotorMnemonic =
					(uint8_t*) L6470_DaisyChainMnemonic[i].MotorIdMnemonic;
			/* ************************************************************************ */

			/* Checks which Application Command has to be performed ******************* */
			L6470_AppCmdId = (eL6470_AppCmdId_t) 0;
			while (!CompareTwoTextString(
					(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->CommandName,
					(uint8_t*) L6470_ApplicationCommand[L6470_AppCmdId].Mnemonic)) {
				L6470_AppCmdId++;
				if (L6470_AppCmdId == L6470APPCMDIDSIZE) {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2, (uint8_t* )"It is not possible to recognize any L6470 application command.\r\n\r\n");
#endif
					return RESET;
				}
			}
			/* The application Command to perform is known */
			/* The max number of parameters has to be the following */
			nr_parameters =
					L6470_ApplicationCommand[L6470_AppCmdId].NrOfParameters;

			/* Check for a right number of entered command parameters */
			i = 0;
			while (i < nr_parameters) {
				if ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[i]))
						== '\0') {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2, (uint8_t* )"The number of parameters related to the application command is not right.\r\n\r\n");
#endif
					return RESET;
				} else {
					i++;
				}
			}
			if (i < 3) /* Max possible parameters */
			{
				if ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[i]))
						!= '\0') {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2, (uint8_t* )"The number of parameters related to the application command is not right.\r\n\r\n");
#endif
					return RESET;
				}
			}
			/* ************************************************************************ */

			/* Checks the application command parameter ******************************* */
			switch (L6470_AppCmdId) {
			case L6470_NOP_ID:
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x00;
				break;
			case L6470_SETPARAM_ID:
				/* Check for possible Register to be addresses */
				L6470_RegId = (eL6470_RegId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_Register[L6470_RegId].Name)) {
					L6470_RegId++;
					if (L6470_RegId == L6470REGIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2, (uint8_t *)"It is not possible to recognize any L6470 register name.\r\n\r\n");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as PARAM) is known ************ */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x00
						| L6470_Register[L6470_RegId].Address;

				/* The length, in byte, of this register (PARAM) is... */
				PARAMLengthBytes = L6470_Register[L6470_RegId].LengthByte;

				/* Checks the numeric parameter that has been entered (as 2nd parameter) */
				if (!str2num(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[1],
						&NumericValue)) {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2, (uint8_t *)"It is not possible to recognize any numeric value.\r\n\r\n");
#endif
					return RESET;
				}
				/* The 2nd application command parameter (as a numeric value) is known */

				/* Build the others bytes to transmit (VALUE) */
				for (spibyte = 1; spibyte < (PARAMLengthBytes + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							(uint8_t) (NumericValue
									>> (8 * (PARAMLengthBytes - spibyte)));
				}
				break;
			case L6470_GETPARAM_ID:
				/* Check for possible Register to be addresses */
				L6470_RegId = (eL6470_RegId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_Register[L6470_RegId].Name)) {
					L6470_RegId++;
					if (L6470_RegId == L6470REGIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2, (uint8_t *)"It is not possible to recognize any L6470 register name.\r\n\r\n");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as PARAM) is known ************ */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x20
						| L6470_Register[L6470_RegId].Address;

				/* The length, in byte, of this register (PARAM) is... */
				PARAMLengthBytes = L6470_Register[L6470_RegId].LengthByte;

				/* Build the others bytes to transmit (VALUE) */
				for (spibyte = 1; spibyte < (PARAMLengthBytes + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							0x00;
				}
				break;
			case L6470_RUN_ID:
				/* Checks the Motor Direction that has been entered (as 1st parameter) */
				L6470_DirId = (eL6470_DirId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_Direction[L6470_DirId].Mnemonic)) {
					L6470_DirId++;
					if (L6470_DirId == L6470DIRIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2, (uint8_t *)"It is not possible to recognize any direction.\r\n\r\n");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as DIR) is known ************** */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x50
						| L6470_DirId;

				/* Checks the numeric parameter that has been entered (as 2nd parameter) */
				if (!str2num(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[1],
						&NumericValue)) {
#ifdef NUCLEO_USE_USART
					USART_Transmit(&huart2, (uint8_t *)"It is not possible to recognize any numeric value.\r\n\r\n");
#endif
					return RESET;
				}
				/* The 2nd application command parameter (as a numeric value) is known */

