YounesGhanem/StepMotor/Projects/STM32F401RE-Nucleo/Examples/MotionControl/MicrosteppingMotor/Src/example_usart.c
				/* Build the others bytes to transmit (SPD) */
				for (spibyte = 1; spibyte < (3 + 1); spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							(uint8_t) (NumericValue >> (8 * (3 - spibyte)));
				}
				break;
			case L6470_RELEASESW_ID:
				/* Checks the Action about ABS_POS register that has been entered (as 1st parameter) */
				L6470_ActId = (eL6470_ActId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[0],
						(uint8_t*) L6470_ACT[L6470_ActId].Mnemonic)) {
					L6470_ActId++;
					if (L6470_ActId == L6470ACTIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2, (uint8_t *)"It is not possible to recognize any action.\r\n\r\n");
#endif
						return RESET;
					}
				}
				/* The 1st application command parameter (as ACT) is known **************** */
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x92
						| (L6470_ActId << 3);

				/* Checks the Motor Direction that has been entered (as 2nd parameter) */
				L6470_DirId = (eL6470_DirId_t) 0;
				while (!CompareTwoTextString(
						(uint8_t*) (pL6470_TextCommandBundle + CmdTxt_id)->Param[1],
						(uint8_t*) L6470_Direction[L6470_DirId].Mnemonic)) {
					L6470_DirId++;
					if (L6470_DirId == L6470DIRIDSIZE) {
#ifdef NUCLEO_USE_USART
						USART_Transmit(&huart2, (uint8_t *)"It is not possible to recognize any direction.\r\n\r\n");
#endif
						return RESET;
					}
				}
				/* The 2nd application command parameter (as DIR) is known ************** */
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) |=
						L6470_DirId;
				break;
			case L6470_GOHOME_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x70;
				break;
			case L6470_GOMARK_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0x78;
				break;
			case L6470_RESETPOS_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xD8;
				break;
			case L6470_RESETDEVICE_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xC0;
				break;
			case L6470_SOFTSTOP_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xB0;
				break;
			case L6470_HARDSTOP_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xB8;
				break;
			case L6470_SOFTHIZ_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xA0;
				break;
			case L6470_HARDHIZ_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xA8;
				break;
			case L6470_GETSTATUS_ID:
				/* Build the 1st byte to transmit */
				*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) = 0xD0;
				/* Build the others bytes to transmit (SPD) */
				for (spibyte = 1; spibyte < 2 + 1; spibyte++) {
					*(pL6470_DaisyChainSpiTxStruct
							+ ((spibyte * L6470DAISYCHAINSIZE) + L6470_Id)) =
							0x00;
				}
				break;
			case L6470_SAVE_ID:
					/* getPosition*/
					motorPosition0 = BSP_L6470_GetParam(0, 1, L6470_ABS_POS_ID);  //L6470_1
					motorPosition1 = BSP_L6470_GetParam(0, 0, L6470_ABS_POS_ID);  //L6470_0

					SaveMotorPositions(motorPosition0, motorPosition1);




				break;

			}
		} else {
#ifdef NUCLEO_USE_USART
			USART_Transmit(&huart2, (uint8_t *)"Both entered commands are addressing the same L6470.\r\n\r\n");
#endif
			return RESET;
		}
		CmdTxt_id++;
	} while ((CmdTxt_id < L6470DAISYCHAINSIZE)
			&& (((*((pL6470_TextCommandBundle + CmdTxt_id)->MotorName)) != '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->CommandName))
							!= '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[0]))
							!= '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[1]))
							!= '\0')
					|| ((*((pL6470_TextCommandBundle + CmdTxt_id)->Param[2]))
							!= '\0')));

	return SET;
}


void SaveMotorPositions(uint32_t motorPosition0, uint32_t motorPosition1) {
    uint32_t data[2];
    data[0] = motorPosition0; // Stocke la position du premier moteur
    data[1] = motorPosition1; // Stocke la position du deuxième moteur

    // Adresse du début du secteur 7, cette valeur est un exemple
    uint32_t sectorAddress = 0x08060000; 
    Flash_WriteData(sectorAddress, data, 2); // Écrit deux mots de 32 bits
}

void Flash_WriteData(uint32_t StartSectorAddress, uint32_t *Data, uint32_t numberOfWords) {
    HAL_FLASH_Unlock();

    // Configuration pour l'effacement du secteur
    FLASH_EraseInitTypeDef EraseInitStruct;
    uint32_t SectorError;
    EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
    EraseInitStruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;
    EraseInitStruct.Sector = FLASH_SECTOR_7;
    EraseInitStruct.NbSectors = 1;

   // Erase memory
    if (HAL_FLASHEx_Erase(&EraseInitStruct, &SectorError) != HAL_OK) {
        // Gestion d'erreur
        HAL_FLASH_Lock();
        return;
    }

    // Write memory
    for (uint32_t i = 0; i < numberOfWords; i++) {
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, StartSectorAddress + i * 4, Data[i]) != HAL_OK) {
            //manage error
            HAL_FLASH_Lock();
            return;
        }
    }

    HAL_FLASH_Lock();
}



// void SaveMotorPositions(uint32_t motorPosition0, uint32_t motorPosition1) {
//     uint64_t data[2];
//     data[0] = motorPosition0; // Assurez-vous que les données correspondent à la taille de l'écriture (ici double mot)
//     data[1] = motorPosition1;

//     // Adresse du début du secteur 7, cette valeur est un exemple
//     uint32_t sectorAddress = 0x08060000; 
//     Flash_WriteData(sectorAddress, data, 2);
// }


