YounesGhanem/StepMotor/Projects/STM32F401RE-Nucleo/Examples/MotionControl/MicrosteppingMotor/Src/example_usart.c
// void Flash_WriteData(uint32_t StartSectorAddress, uint64_t *Data, uint32_t numberOfWords) {
//     HAL_FLASH_Unlock();

//     // Effacement de la mémoire
//     FLASH_Erase_Sector(FLASH_SECTOR_7, VOLTAGE_RANGE_3);

//     // Écriture de la mémoire
//     for (uint32_t i = 0; i < numberOfWords; i++) {
//         HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, StartSectorAddress + i * 8, Data[i]);
//     }

//     HAL_FLASH_Lock();
// }




/**
 * @brief Decode the command string entered via USART
 * @retval None
 * @note It use two function, one to split the whole entered command string and
 *       another one to check for the application command
 */
uint32_t* USART_DecodeTextString(uint8_t *pTextString,
		sL6470_TextCommandBundle *pL6470_TextCommandBundle,
		uint8_t* pL6470_DaisyChainSpiTxStruct,
		uint8_t* pL6470_DaisyChainSpiRxStruct) {
	static uint32_t ReceivedValue[L6470DAISYCHAINSIZE];
	uint8_t L6470_Id;
	eL6470_RegId_t L6470_RegId;
	uint8_t PARAMLengthBytes; /* The number of bytes related to the numeric value for the addressed register */
	eHexFormat HexFormat;

	if (USART_SplitTextString(pTextString, pL6470_TextCommandBundle)
			&& USART_CheckTextCommandBundle(pL6470_TextCommandBundle,
					pL6470_DaisyChainSpiTxStruct)) {
#ifdef NUCLEO_USE_USART
		USART_Transmit(&huart2, (uint8_t *)"Perform the entered L6470 Application Command...\r\n");
#endif
		L6470_DaisyChainCommand(pL6470_DaisyChainSpiTxStruct,
				pL6470_DaisyChainSpiRxStruct);

		/* Check if a value has to be returned */
		for (L6470_Id = 0; L6470_Id < L6470DAISYCHAINSIZE; L6470_Id++) {
			/* Reset the value before fill with the new value */
			ReceivedValue[L6470_Id] = 0x00;

			if ((*(pL6470_DaisyChainSpiTxStruct
					+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) & 0xE0) == 0x20) // The AppCmd has been "GetParam"
					{
				/* The length, in byte, of this register (PARAM) is... */
				/* Check for the Register address */
				L6470_RegId = (eL6470_RegId_t) 0;
				while ((*(pL6470_DaisyChainSpiTxStruct
						+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) & 0x1F)
						!= (L6470_Register[L6470_RegId].Address))
					L6470_RegId++;
				PARAMLengthBytes = L6470_Register[L6470_RegId].LengthByte;
				switch (PARAMLengthBytes) {
				case 1:
					HexFormat = BYTE_F;
					break;
				case 2:
					HexFormat = WORD_F;
					break;
				default:
					HexFormat = DOUBLEWORD_F;
					break;
				}

				ReceivedValue[L6470_Id] = L6470_ExtractReturnedData(L6470_Id,
						pL6470_DaisyChainSpiRxStruct, PARAMLengthBytes);

#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2,
						(uint8_t*) (L6470_DaisyChainMnemonic[L6470_Id].L6470IdMnemonic));
				USART_Transmit(&huart2, (uint8_t* )" ");
				USART_Transmit(&huart2,
						(uint8_t*) (L6470_Register[L6470_RegId].Name));
				USART_Transmit(&huart2, (uint8_t* )" value is 0x");

				USART_Transmit(&huart2,
						num2hex(ReceivedValue[L6470_Id], HexFormat));

				USART_Transmit(&huart2, (uint8_t* )"\r\n");
#endif        
			}

			if (*(pL6470_DaisyChainSpiTxStruct
					+ ((0 * L6470DAISYCHAINSIZE) + L6470_Id)) == 0xD0) // The AppCmd has been "GetStatus"
					{
				ReceivedValue[L6470_Id] = L6470_ExtractReturnedData(L6470_Id,
						pL6470_DaisyChainSpiRxStruct, 2);

#ifdef NUCLEO_USE_USART
				USART_Transmit(&huart2,
						(uint8_t*) (L6470_DaisyChainMnemonic[L6470_Id].L6470IdMnemonic));
				USART_Transmit(&huart2, (uint8_t* )" STATUS value is 0x");

				USART_Transmit(&huart2,
						num2hex(ReceivedValue[L6470_Id], WORD_F));

				USART_Transmit(&huart2, (uint8_t* )"\r\n");
#endif        
			}
		}
#ifdef NUCLEO_USE_USART
		USART_Transmit(&huart2, (uint8_t* )"\r\n");
#endif    
	} else {
#ifdef NUCLEO_USE_USART
		USART_Transmit(&huart2, (uint8_t* )"Please, enter a new command string!\r\n\r\n");
#endif
	}

	return ReceivedValue;
}

/**
 * @brief  This function compares two text strings.
 * @param  TextString1 The pointer to the 1st text string to compare.
 * @param  TextString2 The pointer to the 2nd text string to compare.
 * @retval FlagStatus    SET or RESET related the comparison.
 */
FlagStatus CompareTwoTextString(uint8_t* TextString1, uint8_t* TextString2) {
	uint8_t i; /* to index the two text strings to be compared */
	uint8_t c1, c2; /* to store the two characters to be compared */

	i = 0;

	do {
		c1 = *(TextString1 + i);
		c2 = *(TextString2 + i);

		if (c1 != c2) {
			return RESET;
		}
		i++;
	} while ((c1 != '\0') && (c2 != '\0'));

	return SET;
}

/**
 * @brief  This function converts a text string into a number.
 * @param  str       The pointer to the text string to convert.
 * @param  pnum      The pointer to the numerical variable.
 * @retval FlagStatus  SET or RESET related to the conversion.
 */
FlagStatus str2num(uint8_t* str, uint32_t* pnum) {
	uint8_t TxtStr_digit, digit;
	uint32_t tenpwr;
	uint32_t number;

	digit = 0;

	while (*(str + digit) != '\0') {
		if (((*(str + digit) >= '0') && (*(str + digit) <= '9'))) {
			digit++;
		} else {
			*pnum = 0;
			return RESET;
		}
	}

	tenpwr = 1;
	number = 0;

	do {
		TxtStr_digit = (*(str + (--digit)));
		number += ((TxtStr_digit - '0') * tenpwr);
		tenpwr *= 10;
	} while (digit);

	*pnum = number;
	return SET;
}

/**
 * @}
 *//* End of ExampleUsartPrivateFunctions */

/**
 * @addtogroup   ExampleUsartExportedFunctions
 * @{
 */

/**
 * @brief  Transmit the initial message to the PC which is connected to the
 *         NUCLEO board via UART.
 */
void USART_TxWelcomeMessage(void) {
	/* Send information to PC via USART */
	USART_Transmit(&huart2, (uint8_t* )"\r\n");
	USART_Transmit(&huart2, (uint8_t* )" X-NUCLEO-IHM02A1\r\n");
	USART_Transmit(&huart2, (uint8_t* )" -------------------------------------------\r\n");
	USART_Transmit(&huart2, (uint8_t* )" Dual L6470 Expansion Board for STM32 NUCLEO\r\n");
	USART_Transmit(&huart2, (uint8_t* )" Stacked on ");
	USART_Transmit(&huart2, NUCLEO_BOARD_NAME);
	USART_Transmit(&huart2, (uint8_t* )" \r\n");
	USART_Transmit(&huart2, (uint8_t* )" X-CUBE-SPN2 v1.1.1\r\n");
	USART_Transmit(&huart2, (uint8_t* )" STMicroelectronics, 2015\r\n\r\n");
}


void USART_TxHelpMenu(void) {
    /* Send header and introduction */

	USART_Transmit(&huart2,"Quick and Dirty Application to command two Step Motors\r\n");
    USART_Transmit(&huart2, (uint8_t *)" Younès Ghanem\r\n");
	USART_Transmit(&huart2, (uint8_t *)"\r\n");
	USART_Transmit(&huart2, (uint8_t *)"\r\n");
    USART_Transmit(&huart2, (uint8_t *)" HELP MENU: Motor Control Commands\r\n");
    USART_Transmit(&huart2, (uint8_t *)" ---------------------------------\r\n");
    USART_Transmit(&huart2, (uint8_t *)" Understand how to structure commands:\r\n");
    USART_Transmit(&huart2, (uint8_t *)" [MotorID].[Command].[Direction].[Value]\r\n\r\n");

    /* Detailed command descriptions */
    USART_Transmit(&huart2, (uint8_t *)" MotorID:\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   M0, M1 - Identifiers for motors connected.\r\n\r\n");
    USART_Transmit(&huart2, (uint8_t *)" Command:\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   RUN, MOV, GOTO, STOP - Actions for the motor.\r\n\r\n");
    USART_Transmit(&huart2, (uint8_t *)" Direction:\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   FWD (Forward), REV (Reverse) - Motion direction.\r\n\r\n");
    USART_Transmit(&huart2, (uint8_t *)" Value:\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   Numeric, depends on the command - e.g., speed, steps.\r\n\r\n");

    /* Command examples */
    USART_Transmit(&huart2, (uint8_t *)" Examples:\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   M1.RUN.FWD.200 - Motor M1 runs forward at speed 200.\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   M2.MOV.REV.500 - Motor M2 moves reverse 500 steps.\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   M1.GOTO.FWD.1000 - Motor M1 goes to position 1000 forward.\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   M3.SOFTSTOP - Stops Motor M0 immediately.\r\n\r\n");

    /* Additional notes */
    USART_Transmit(&huart2, (uint8_t *)" Note:\r\n");
    USART_Transmit(&huart2, (uint8_t *)"   Consult motor driver datasheet for specific command details.\r\n\r\n");
}
/**
 * @brief  Send a text string via USART.
 * @param  huart       pointer to a UART_HandleTypeDef structure that contains
 *                     the configuration information for the specified UART module.
 * @param  TextString  The text string to be sent.
 * @note It use the HAL_UART_Transmit function.
 */
void USART_Transmit(UART_HandleTypeDef* huart, uint8_t* TextString) {
	uint8_t TextStringLength;

	/* Calculate the length of the text string to be sent */
	TextStringLength = 0;
	while (TextString[TextStringLength++] != '\0')
		;
	TextStringLength--;

