YounesGhanem/StepMotor/Projects/STM32F401RE-Nucleo/Examples/MotionControl/MicrosteppingMotor/Src/example_usart.c
	/* Use the HAL function to send the text string via USART */
	HAL_UART_Transmit(huart, TextString, TextStringLength, 10);
}

/**
 * @brief  Check if any Application Command for L6470 has been entered by USART
 *         so to proceed to decode and perform the command.
 */
void USART_CheckAppCmd(void) {
	/* Checks the UART2 is in idle state */
	if (huart2.State == HAL_UART_STATE_READY) {
		/* Checks one character has been at least entered */
		if (UsartTextString[0] != '\0') {
			/* Decode the entered command string */
			USART_DecodeTextString(UsartTextString, L6470_TextCommandBundle,
					(uint8_t*) L6470_DaisyChainSpiTxStruct,
					(uint8_t*) L6470_DaisyChainSpiRxStruct);
		}

		/* Prepare to receive a text string via USART with UART_IT_RXNE */
		NucleoUsartReceiveIT(&huart2, UsartTextString, USARTTEXTSTRINGSIZE);
	}
}


// void USART_CheckAppCmd(void) {
//     /* Check if UART2 is ready */
//     if (huart2.State == HAL_UART_STATE_READY) {
//         /* Check if any text is present in the input buffer */
//         if (UsartTextString[0] != '\0') {
//             /* Decode and execute the command */
//             USART_DecodeTextString(UsartTextString);

//             /* Clear the input buffer */
//             memset(UsartTextString, 0, sizeof(UsartTextString));
//         }

//         /* Prepare to receive another command via UART with interrupt */
//         NucleoUsartReceiveIT(&huart2, UsartTextString, USARTTEXTSTRINGSIZE);
//     }
// }


/**
 * @brief  Handle text character just received.
 * @param  huart pointer to a UART_HandleTypeDef structure that contains
 *               the configuration information for the specified UART module.
 * @note To use inside USART2_IRQHandler function.
 */
void USART_ITCharManager(UART_HandleTypeDef* huart) {
	uint8_t UART_Receive_IT_Char;

	UART_Receive_IT_Char = (uint8_t) (huart->Instance->USART_DATA_REGISTER);
	/* Checks the buffer full or retur carriage  */
	if ((huart->RxXferCount == 1) || (UART_Receive_IT_Char == '\r')) {
		huart->RxXferCount += 1;
		huart->pRxBuffPtr -= 1;
		*(huart->pRxBuffPtr) = '\0';

		USART_Transmit(huart, (uint8_t *)"\r\n");

		while (HAL_IS_BIT_SET(huart->Instance->USART_STATUS_REGISTER,
				UART_FLAG_RXNE)) {
		}
		__HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);

		/* Check if a transmit process is ongoing or not */
		if (huart->State == HAL_UART_STATE_BUSY_TX_RX) {
			huart->State = HAL_UART_STATE_BUSY_TX;
		} else {
			/* Disable the UART Parity Error Interrupt */
			__HAL_UART_DISABLE_IT(huart, UART_IT_PE);

			/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
			__HAL_UART_DISABLE_IT(huart, UART_IT_ERR);

			huart->State = HAL_UART_STATE_READY;
		}
	}
}

/**
 * @brief  Print on the PC screen the values of the L6470 Registers.
 * @param  ExpBrd    The addressed Expansion Board
 * @param  L6470_Id  The addressed L6470
 *         
 */
void USART_PrintRegisterValues(uint8_t ExpBrd, uint8_t L6470_Id) {
	uint8_t r;
	uint32_t value;

	/* Initialize the used GPIO for the L6470 nCS related to the addressed X-NUCLEO-IHM02A1 */
	if (BSP_Select(ExpBrd)) {
		USART_Transmit(&huart2, (uint8_t* )"\r\n");

		USART_Transmit(&huart2, (uint8_t* )"Values of the registers of L6470_#");
		USART_Transmit(&huart2, num2hex(L6470_Id, HALFBYTE_F));
		USART_Transmit(&huart2, (uint8_t* )" of ExpBrd_#");
		USART_Transmit(&huart2, num2hex(ExpBrd, HALFBYTE_F));
		USART_Transmit(&huart2, (uint8_t* )"\r\n\r\n");

		for (r = 0; r < L6470REGIDSIZE; r++) {
			value = L6470_GetParam(L6470_Id, (eL6470_RegId_t) r);

			USART_Transmit(&huart2, L6470_GetRegisterName((eL6470_RegId_t) r));
			USART_Transmit(&huart2, (uint8_t* )": ");
			USART_Transmit(&huart2, num2hex(value, DOUBLEWORD_F));
			USART_Transmit(&huart2, (uint8_t* )"\r\n");
		}

		USART_Transmit(&huart2, (uint8_t* )"\r\n");
	}
}

/**
 * @brief  Print on the PC screen the values of the L6470 Registers for all
 *         devices mounted on all stacked X-NUCLEO-IHM02A1.
 */
void USART_PrintAllRegisterValues(void) {
	uint8_t ExpBrd; /* to index the expansion board to be addressed */
	uint8_t L6470_Id; /* to index the L6470 into the daisy chain to be addressed */

	for (ExpBrd = EXPBRD_ID(0); ExpBrd <= EXPBRD_ID(EXPBRD_MOUNTED_NR - 1);
			ExpBrd++) {
		for (L6470_Id = L6470_ID(0);
				L6470_Id <= L6470_ID(L6470DAISYCHAINSIZE - 1); L6470_Id++) {
			USART_PrintRegisterValues(ExpBrd, L6470_Id);
		}
	}
}

/**
 * @brief  Fill the L6470_DaisyChainMnemonic structure.
 *
 * @note   This structure will contain the assigned names about the L6470
 *         devices inside the daisy chain and theirs related motors.
 * @note   Its size and contents is updated at boot in relation to the L6470DAISYCHAINSIZE.
 */
void Fill_L6470_DaisyChainMnemonic(void) {
	uint8_t i;
	char c1 = '0';
	char c10 = '0';

	for (i = 0; i < L6470DAISYCHAINSIZE; i++) {
		if (i < 10) {
			c10 = '0' + i;
			c1 = '\0';
		} else {
			c10 = '0' + (i / 10);
			c1 = '0' + (i - ((i / 10) * 10));
		}

		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[0] = 'L';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[1] = '6';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[2] = '4';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[3] = '7';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[4] = '0';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[5] = '#';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[6] = c10;
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[7] = c1;
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[8] = '\0';
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[0] = 'M';
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[1] = c10;
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[2] = c1;
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[3] = '\0';
	}
}

/**
 * @brief  Convert a number nbr into a string str with 7 characters.
 * @param  nbr The number to be converted.
 * @param  str The container of the converted number into a text in decimal
 *         format.
 * @note   The decimal digits of the number must be maximum 7 so str has to be
 *         able to store at least 7 characters plus '\0'.
 */
void num2str(uint32_t nbr, uint8_t *str) {
	uint8_t k;
	uint8_t *pstrbuff;
	uint32_t divisor;

	pstrbuff = str;

	/* Reset the text string */
	for (k = 0; k < 7; k++)
		*(pstrbuff + k) = '\0';

	divisor = 1000000;

	if (nbr) // if nbr is different from zero then it is processed
	{
		while (!(nbr / divisor)) {
			divisor /= 10;
		}

		while (divisor >= 10) {
			k = nbr / divisor;
			*pstrbuff++ = '0' + k;
			nbr = nbr - (k * divisor);
			divisor /= 10;
		}
	}

	*pstrbuff++ = '0' + nbr;
	*pstrbuff++ = '\0';
}

/**
 * @brief  Convert an integer number into hexadecimal format.
 *
 * @param  num         The integer number to convert.
 * @param  HexFormat   The output format about hexadecimal number.
 *
 * @retval uint8_t*    The address of the string text for the converted hexadecimal number.
 */
uint8_t* num2hex(uint32_t num, eHexFormat HexFormat) {
	static uint8_t HexValue[8 + 1];
	uint8_t i;
	uint8_t dummy;
	uint8_t HexDigits = 0;

	switch (HexFormat) {
	case HALFBYTE_F:
		HexDigits = 1;
		break;
	case BYTE_F:
		HexDigits = 2;
		break;
	case WORD_F:
		HexDigits = 4;
		break;
	case DOUBLEWORD_F:
		HexDigits = 8;
		break;
	}

	for (i = 0; i < HexDigits; i++) {
		HexValue[i] = '\0';
		dummy = (num & (0x0F << (((HexDigits - 1) - i) * 4)))
				>> (((HexDigits - 1) - i) * 4);
		if (dummy < 0x0A) {
			HexValue[i] = dummy + '0';
		} else {
			HexValue[i] = (dummy - 0x0A) + 'A';
		}
	}
	HexValue[i] = '\0';

	return HexValue;
}

/**
 * @}
 *//* End of ExampleUsartExportedFunctions */

/**
 * @}
 *//* End of ExampleUsart */

/**
 * @}
 *//* End of MicrosteppingMotor_Example */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
